package _10_regex._01_sintax;

public class Main {
    public static void main(String[] args) {
        /* 1. Метасимволы для поиска границ текста и строк
            ^ начало строки
            $ конец строки
            \b - граница слова
            \B - не граница слова

            2. Метасимволы для поиска символьных классов
            \d - цифровой символ
            \D - нецифровой символ
            \s - символ пробела
            \S - непробельный символ
            \w - буквенно-цифровой символ и знак _
            \W - любой, кроме букв-цифр и _
            . - любой символ

            3. Симвоы редактирования текста
            \t - табуляция
            \n - новая строка
            \r - новая строка (MAC)
            \f - новая страница

            4. Группировка символов
            [afg] - любой из перечисленных символов
            [^afg] - любой кроме перечисленных символов
            [a-zA-Z] - a-z игнорируя регистр

            5. Квантификаторы
            ? - один или отсутствует
            * - ноль или более раз
            + - один или более раз
            {n} - n-раз
            {n,} - n и более раз
        */
    }
}
